package ru.netology.nmedia

import ru.netology.nmedia.model.Post

    val initPosts = listOf(
        Post(
            id = 1,
            publishedDate = 1758622320, //"23 сентября в 10:12"
            author = "Нетология. Университет интернет-профессий будущего",
            text = "Освоение новой профессии — это не только открывающиеся возможности и перспективы, но и настоящий вызов самому себе. Приходится выходить из зоны комфорта и перестраивать привычный образ жизни: менять распорядок дня, искать время для занятий, быть готовым к возможным неудачам в начале пути. В блоге рассказали, как избежать стресса на курсах профпереподготовки → http://netolo.gy/fPD",
            videoLink = "https://rutube.ru/video/8ec3bce92ea95b3340af7511e533cbc0/?r=plwd",
            videoDescription = "Иллюстрация в медиа",
            videoDate = "12 ДЕКАБРЯ 2025",
            commentsCount = 94,
            likesCount = 90,
            viewsCount = 362,
            repostsCount = 1
        ),
        Post(
            id = 2,
            publishedDate = 1758552328, //"22 сентября в 14:45",
            author = "Нетология. Университет интернет-профессий будущего",
            text = "Делиться впечатлениями о любимых фильмах легко, а что если рассказать так, чтобы все заскучали",
            commentsCount = 944,
            likesCount = 80,
        ),
        Post(
            id = 3,
            publishedDate = 1758535920, // "22 сентября в 10:12",
            author = "Нетология. Университет интернет-профессий будущего",
            text = "Таймбоксинг — отличный способ навести порядок в своём календаре и разобраться с делами, которые долго откладывали на потом. Его главный принцип — на каждое дело заранее выделяется определённый отрезок времени. В это время вы работаете только над одной задачей, не переключаясь на другие. Собрали советы, которые помогут внедрить таймбоксинг \uD83D\uDC47\uD83C\uDFFB",
            videoLink = "https://rutube.ru/video/8ec3bce92ea95b3340af7511e533cbc0/?r=plwd",
            videoDescription = "Иллюстрация в медиа",
            videoDate = "10 ДЕКАБРЯ 2025",
            commentsCount = 944,
            likesCount = 70,
            viewsCount = 52100,
            repostsCount = 54
        ),
        Post(
            id = 4,
            publishedDate = 1758449520, //"21 сентября в 10:12"
            author = "Нетология. Университет интернет-профессий будущего",
            text = "24 сентября стартует новый поток бесплатного курса «Диджитал-старт: первый шаг к востребованной профессии» — за две недели вы попробуете себя в разных профессиях и определите, что подходит именно вам → http://netolo.gy/fQ",
            videoLink = "https://rutube.ru/video/8ec3bce92ea95b3340af7511e533cbc0/?r=plwd",
            videoDescription = "Иллюстрация в медиа",
            videoDate = "01 ДЕКАБРЯ 2025",
            commentsCount = 41,
            likesCount = 60,
            viewsCount = 365,
            repostsCount = 540
        ),
        Post(
            id = 5,
            publishedDate = 1758363240, // 20 сентября в 10:14,
            author = "Нетология. Университет интернет-профессий будущего",
            text = "Диджитал давно стал частью нашей жизни: мы общаемся в социальных сетях и мессенджерах, заказываем еду, такси и оплачиваем счета через приложения.",
            commentsCount = 25,
            likesCount = 50,
            viewsCount = 996,
            repostsCount = 54
        ),
        Post(
            id = 6,
            publishedDate = 1758291120, // 19 сентября в 14:12,
            author = "Нетология. Университет интернет-профессий будущего",
            text = "Большая афиша мероприятий осени: конференции, выставки и хакатоны для жителей Москвы, Ульяновска и Новосибирска",
            commentsCount = 28,
            likesCount = 40,
            viewsCount = 3102000,
            repostsCount = 2500
        ),
        Post(
            id = 7,
            publishedDate = 1758277440, // 19 сентября в 10:24",
            author = "Нетология. Университет интернет-профессий будущего",
            text = "Языков программирования много, и выбрать какой-то один бывает нелегко. Собрали подборку статей, которая поможет вам начать, если вы остановили свой выбор на JavaScript.",
            commentsCount = 4,
            likesCount = 30,
            viewsCount = 1102,
            repostsCount = 800
        ),
        Post(
            id = 8,
            publishedDate = 1758190320, // 18 сентября в 10:12",
            author = "Нетология. Университет интернет-профессий будущего",
            text = "Знаний хватит на всех: на следующей неделе разбираемся с разработкой мобильных приложений, учимся рассказывать истории и составлять PR-стратегию прямо на бесплатных занятиях",
            videoLink = "https://rutube.ru/video/8ec3bce92ea95b3340af7511e533cbc0/?r=plwd",
            videoDescription = "Иллюстрация в медиа",
            videoDate = "28 НОЯБРЯ 2025",
            commentsCount = 4,
            likesCount = 20,
            viewsCount = 41,
            repostsCount = 6
        ),
        Post(
            id = 9,
            publishedDate = 1747841760, //"21 мая в 18:36"
            author = "Нетология. Университет интернет-профессий будущего",
            text = "Привет, это новая Нетология! Когда-то Нетология начиналась с интенсивов по онлайн-маркетингу. Затем появились курсы по дизайну, разработке, аналитике и управлению. Мы растём сами и помогаем расти студентам: от новичков до уверенных профессионалов. Но самое важное остаётся с нами: мы верим, что в каждом уже есть сила, которая заставляет хотеть больше, целиться выше, бежать быстрее. Наша миссия — помочь встать на путь роста и начать цепочку перемен → http://netolo.gy/fyb",
            videoLink = "invalid_link",
            videoDescription = "Иллюстрация в медиа",
            videoDate = "18 НОЯБРЯ 2025",
            commentsCount = 12,
            likesCount = 10,
            viewsCount = 30,
            repostsCount = 1
        ),
    )
